RedditOnRails/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "l1xKfEZhsrHZtZHZctx4ZA"], ["updated_at", "2019-04-10 00:09:24.604300"], ["id", 1]]