RedditOnRails/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
---
<ul>
<% @post.top_level_comments.each do |comment| %>