RedditOnRails/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["post_id", 3], ["content", " actually a reply to a comment"], ["created_at", "2019-04-09 22:18:09.738646"], ["updated_at", "2019-04-09 22:18:09.738646"], ["parent_comment_id", 1]]
---
    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = current_user.id
        @comment.post_id = params[:comment][:post_id]
        if @comment.save