RedditOnRails/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dsfasdf"], ["url", "asdfasd"], ["content", "dsfasd"], ["user_id", 1], ["created_at", "2019-04-09 21:01:41.712291"], ["updated_at", "2019-04-09 21:01:41.712291"]]